import 'package:flutter/material.dart';

import '../wezaraCodes.dart';

class egyptCode extends StatelessWidget {

  static const String routeName = 'egypt' ;

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.grey,
      appBar: AppBar(
        centerTitle: true,
       backgroundColor: Colors.blueGrey,
       title: Text("أرقام الوزارات" , style: TextStyle(color: Colors.white),),
      ),
      body: SingleChildScrollView(
        child: Container(
          decoration: BoxDecoration(
            image: DecorationImage(
              image: AssetImage("asset/pattern.png"),
              fit: BoxFit.cover,
            ),
          ),
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.stretch,
            children: [
              WezaraCodes("""رئاسة مجلس الوزراء

العنوان: شارع مجلس الشعب، القصر العيني، القاهرة

رقم التليفون: 0227958014- 0227958035- 0227958036

رقم الفاكس: 0227958048- 0227958016

البريد الإلكتروني: primemin@idsc.gov.eg"""),
              WezaraCodes("""وزارة الدفاع والإنتاج الحربي
                 
          العنوان: شارع 23 يوليو، كوبري القبة، القاهرة
          
          رقم التليفون: 0224032158
          
          رقم الفاكس: 0222916227
          
          البريد الإلكتروني: mmc@afmic.gov.eg"""),
              WezaraCodes("""وزارة الدولة للإنتاج الحربي
          
          العنوان: 5 شارع إسماعيل أباظة،لاظوغلي، بجوار ضريح سعد زغلول، القاهرة
          
          رقم التليفون: 0227951428
          
          رقم الفاكس: 0222634427
          
          البريد الإلكتروني: minlog@momop.gov.eg"""),
              WezaraCodes("""وزارة البترول والثروة المعدنية
          
          العنوان: 1 شارع أحمد الزمر، مدينة نصر، بجوار انبي، القاهرة
          
          رقم التليفون: 0227601401
          
          رقم الفاكس: 0222746060
          
          البريد الإلكتروني: mop@egyptonline.com"""),
              WezaraCodes("""وزارة الكهرباء والطاقة
          
          العنوان: 8 امتداد شارع رمسيس، ميدان العباسية، أول مدينة نصر،
          
          أمام ملاعب كلية الشرطة، القاهرة
          
          رقم التليفون: 0224012365
          
          رقم الفاكس: 0222616302
          
          البريد الإلكتروني: info@moee.gov.eg"""),
              WezaraCodes("""وزارة الخارجية
              
          العنوان: ماسبيرو، كورنيش النيل، بجوار مبنى الإذاعة والتليفزيون، القاهرة
          
          رقم التليفون: 0225749817
          
          رقم الفاكس: 0225748822
          
          البريد الإلكتروني: Contact.Us@mfa.gov.eg"""),
              WezaraCodes("""وزارة الدولة لشئون البيئة
              
          العنوان: 30 طريق مصر حلوان الزراعي، خلف فندق سوفوتيل المعادي،القاهرة
          
          رقم التليفون: 0225256452- 0225266162
          
          رقم الفاكس: 0225256490
          
          البريد الإلكتروني: eeaa@eeaa.gov.eg"""),
              WezaraCodes("""وزارة الاتصالات وتكنولوجيا المعلومات
          
          العنوان: القرية الذكية، الكيلو 28 طريق القاهرة/الإسكندرية الصحراوي
          
          رقم التليفون: 0223444544
          
          رقم الفاكس: 0235371111
          
          البريد الإلكتروني: webmaster@mcit.gov.eg"""),
              WezaraCodes("""وزارة التربية والتعليم
          
          العنوان: 12 شارع الفلكي، القاهرة
          
          رقم التليفون: 0225787644- 0227947363
          
          رقم الفاكس: 0227962952
          
          البريد الإلكتروني: emis@support.emoe.org"""),
              WezaraCodes("""وزارة العدل
          
          العنوان: ميدان لاظوغلي، مبنى وزارة العدل
          
          رقم التليفون: 0227922263
          
          رقم الفاكس: 0227958103
          
          البريد الإلكتروني: info@moj.gov.eg"""),
              WezaraCodes("""وزارة الدولة للتنمية المحلية
          
          العنوان: 4 شارع نادي الصيد، الدور العاشر، الدقي، القاهرة
          
          رقم التليفون: 0233067082
          
          رقم الفاكس: 0237497788
          
          البريد الإلكتروني: mld.eg@hotmail.com"""),
              WezaraCodes("""وزارة الإسكان والمرافق والتنمية العمرانية
          
          العنوان: 1 شارع إسماعيل أباظة، متفرع من شارع القصر العيني، القاهرة
          
          رقم التليفون: 0227921442
          
          رقم الفاكس: 0227921423
          
          البريد الإلكتروني: info@housing-utility.gov.eg"""),
              WezaraCodes("""وزارة الأوقاف
          
          العنوان: شارع صبري أبوعلم، باب اللوق
          
          رقم التليفون: 0223931216
          
          رقم الفاكس: 0223929828
          
          البريد الإلكتروني: mawkaf@idsc1.gov.eg"""),
              WezaraCodes("""وزارة الداخلية
          
          العنوان: شارع الشيخ ريحان، القاهرة
          
          رقم التليفون: 0227948300 -0227959111- 0227952300
          
          رقم الفاكس: 0227960682
          
          البريد الإلكتروني: center@iscmi.gov.eg"""),
              WezaraCodes("""وزارة التعليم العالي
          
          العنوان: 101 شارع القصر العيني
          
          رقم التليفون: 0227920323
          
          رقم الفاكس: 0227941005
          
          البريد الإلكتروني: mohe.info@gmail.com""")
            ],
          ),
        ),
      )
    );
  }
}
