import 'package:flutter/material.dart';

import '../GamaaCodes.dart';

class gamaaModel extends StatelessWidget {
  static const String routeName = 'gamaa';
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.grey,
      appBar: AppBar(
        backgroundColor: Colors.blueGrey,
        centerTitle: true,
        title: Text(
          "جامعات مصر",
          style: TextStyle(color: Colors.white),
        ),
      ),
      body: SingleChildScrollView(
        child: Container(
          decoration: BoxDecoration(
            image: DecorationImage(
              image: AssetImage("asset/pattern.png"),
              fit: BoxFit.cover,
            ),
          ),
          child: Column(
            children: [
              GamaaCodes("""جامعة القاهرة
مقر الجامعة: شارع جامعة القاهرة، ميدان النهضة، الجيزة
تليفون الجامعة: 35676105
موقع الجامعة: https://cu.edu.eg/ar/Home
يوجد في جامعة القاهرة 29 كلية ومعهدًا وهى:
طريقة التقديم: التنسيق الإلكترونى
كلية الهندسة- كلية الطب- كلية الحاسبات والذكاء الاصطناعى- كلية الصيدلة- كلية الزراعة- كلية العلوم- كلية الاقتصاد والعلوم السياسية- كلية الإعلام- كلية الآثار- كلية الآداب- كلية التجارة- كلية التربية النوعية- كلية التمريض- كلية الحقوق- كلية العلاج الطبيعى- كلية طب الفم والأسنان- كلية الطب البيطرى- كلية دار العلوم- كلية التربية للطفولة المبكرة- كلية التخطيط الإقليمى والعمرانى- كلية الدراسات الإفريقية العليا- كلية الدراسات العليا للبحوث الإحصائية- المعهد القومى للأورام- كلية الدراسات العليا للتربية- المعهد القومى لعلوم الليزر- مركز التعليم المفتوح- مركز جامعة القاهرة للغة والثقافة العربية- مركز الحساب العلمى- كلية الدراسات العليا للنانو تكنولوجى.
يوجد لجامعة القاهرة فرع آخر بمدينة الشيخ زايد مقره: شارع النزهة- بجوار هايبر وان."""),
              GamaaCodes("""جامعة الإسكندرية
          مقرها: 22 طريق الجيش، الشاطبى الإسكندرية
          تليفون: 8/7/6/ 5921675 (03)
          طرق التقديم: التنسيق الإلكترونى
          كلية الطب- كلية الصيدلة- كلية طب الأسنان- كلية التمريض- كلية الطب البيطرى- معهد البحوث الطبية- المعهد العالى للعلوم الصحية- كلية التجارة- كلية الحقوق- كلية الآداب- كلية الفنون الجميلة- كلية السياحة والفنادق- كلية الدراسات الاقتصادية والعلوم السياسية- كلية التربية- كلية التربية النوعية- كلية التربية للطفولة المبكرة- كلية التربية الرياضية بنين- كلية التربية الرياضية للبنات- كلية العلوم- كلية الزراعة- كلية الزراعة سابا باشا- كلية الهندسة- كلية الحاسبات وعلوم البيانات- معهد الدراسات العليا والبحوث.
          تضم جامعة الإسكندرية 24 كلية ومعهدًا وهى:
          الموقع الإلكترونى:- https://alexu.edu.eg/index.php/en/
          
          """),
              GamaaCodes("""جامعة عين شمس
          طريقة التقديم: التنسيق الإلكترونى
          أرقام التليفون:
          26831474
          مقرها:
          شارع الخليفة المأمون- العباسية- القاهرة- مصر
          الموقع الإلكترونى:
          https://www.asu.edu.eg/ar
          تضم 19 كلية ومعهدًا إلى جانب كلية تحت الإنشاء وهى:
          كلية الصيدلة- كلية العلوم- كلية الطب- كلية طب الأسنان- كلية الحاسبات والمعلومات- كلية الهندسة- كلية التربية- كلية الألسن- كلية التجارة- كلية التربية النوعية- كلية الزراعة- كلية الحقوق- كلية التمريض- كلية الآداب- كلية البنات- كلية الآثار- كلية الدراسات والبحوث البيئية- كلية الدراسات العليا للطفولة- معهد البحوث الزراعية في المناطق القاحلة- كلية الشؤون والأعمال الدولية (تحت الإنشاء)."""),
              GamaaCodes("""جامعة أسيوط
          مقر الجامعة: شارع الجامعة، نايلة خاتون، حى غرب، أسيوط
          رقم التليفون: 088-2354130
          الموقع الإلكترونى: https://www.aun.edu.eg/main/ar
          طريقة التقديم: التنسيق الإلكترونى
          يوجد بها 17 كلية ومعهدًا وهى:
          كلية العلوم- كلية الهندسة- كلية الزراعة- كلية الطب -كلية الصيدلة- كلية الطب البيطرى- كلية التجارة- كلية التربية- كلية الحقوق- كلية التربية الرياضية- كلية التمريض- كلية التربية النوعية- كلية التربية بالوادى الجديد- كلية الخدمة الاجتماعية- كلية الآداب- كلية الحاسبات والمعلومات- كلية طب الأسنان- معهد بحوث وتكنولوجيا صناعة السكر- معهد جنوب مصر للأورام.
          
          """),
              GamaaCodes("""جامعة المنصورة
          مقر الجامعة: شارع الجمهورية- المنصورة
          رقم التليفون: 2200706 (50) 20+ أو 2200720 (50) 20+
          الموقع الإلكترونى: https://www.mans.edu.eg/
          طريقة التقديم: التنسيق الإلكترونى
          يوجد بها 18 كلية وهى:
          كلية الهندسة- كلية الطب- كلية الزراعة- كلية العلوم- كلية التربية- كلية طب الأسنان- كلية الصيدلة- كلية التجارة- كلية الحقوق- كلية الآداب- كلية التربية النوعية- كلية الطب البيطرى- كلية التمريض- كلية التربية للطفولة المبكرة- كلية التربية الرياضية- كلية الحاسبات والمعلومات- كلية السياحة والفنادق- كلية الفنون الجميلة."""),
              GamaaCodes("""جامعة حلوان
          مقر الجامعة: المساكن الاقتصادية، قسم حلوان، محافظة القاهرة‬
          رقم التليفون: ٢٨١٦٢٠٦١ – ٢٨١٦٢٠٦٢
          الموقع الإلكترونى: http://www.helwan.edu.eg/
          طريقة التقديم: التنسيق الإلكترونى
          يوجد بجامعة حلوان 23 كلية وهى:
          ﻛﻠﻴﺔ الحقوق- ﻛﻠﻴﺔ الحاسبات والذكاء الاصطناعى- ﻛﻠﻴﺔ الفنون الجميلة- كلية الفنون التطبيقية- ﻛﻠﻴﺔ التربية الرياضية بنات- كلية العلوم- كلية السياحة والفنادق- ﻛﻠﻴﺔ اﻟتمريض- كلية الخدمة الاجتماعية- ﻛﻠﻴﺔ الاقتصاد المنزلى- كلية التربية الرياضية بنين- ﻛﻠﻴﺔ التربية- ﻛﻠﻴﺔ التكنولوجيا والتعليم- اﻟﻤﻌﻬﺪ اﻟﻘﻮﻣى ﻟﻠﻤﻠﻜﻴﺔ اﻟﻔﻜﺮﻳﺔ- ﻛﻠﻴﺔ الآداب- ﻛﻠﻴﺔ الهندسة بالمطرية- كلية التربية الفنية- كلية التجارة وإدارة الأعمال- كلية التربية الموسيقية- ﻛﻠﻴﺔ الطب- ﻛﻠﻴﺔ الصيدلة- ﻛﻠﻴﺔ اﻟﺪراﺳﺎت اﻟﻌﻠﻴﺎ واﻟﺒﺤﻮث اﻟﺒﻴﻨﻴﺔ- كلية الهندسة بحلوان"""),
              GamaaCodes("""جامعة الزقازيق
          مقرها: الزقازيق- الشرقية
          طريقة التقديم: التنسيق الإلكترونى
          الموقع الإلكترونى: https://www.zu.edu.eg/Home/Index#
          طرق التواصل مع الجامعة:
          البريد الإلكترونى: info@zu.edu.eg
          الرقم البريدى: 44519
          تليفون: 0552363635
          تضم جامعة الزقازيق 25 كلية ومعهدًا وهى:
          كلية الزراعة- كلية الهندسة- كلية الطب البشرى بالزقازيق- كلية الطب البشرى بفاقوس- كلية الصيدلة- كلية العلوم- كلية طب وجراحة الفم والأسنان- كلية الطب البيطرى- كلية التجارة- كلية الآداب- كلية التربية- كلية التكنولوجيا والتنمية- كلية التربية الرياضية بنات- كلية التربية الرياضية بنين- كلية التمريض- كلية الحقوق- كلية التربية النوعية- كلية الحاسبات والمعلومات.
          
          """),
              GamaaCodes("""جامعة المنوفية
          مقرها: شارع جمال عبدالناصر- شبين الكوم- المنوفية
          طريقة التقديم: التنسيق الإلكترونى
          الموقع الإلكترونى: https://www.menofia.edu.eg/Home/ar
          طرق التواصل مع الجامعة:
          أرقام التليفون: 2224216-2048- 2224155-2048
          الفاكس: 5752777-202 / 2226454-2048
          البريد الإلكترونى menofia@menofia.edu.eg
          تضم جامعة المنوفية 23 كلية ومعهدًا وهى:
          كلية الزراعة- كلية الهندسة بشبين الكوم- كلية الهندسة الإلكترونية بمنوف- كلية التربية- كلية العلوم- كلية الذكاء الاصطناعى- كلية التجارة- كلية الطب- كلية الآداب- كلية الحقوق- كلية الاقتصاد المنزلى- كلية التمريض- كلية التربية النوعية- معهد الكبد- كلية الحاسبات والمعلومات- كلية الإعلام- كلية التربية الرياضية- كلية تكنولوجيا العلوم الصحية التطبيقية- كلية التربية للطفولة المبكرة."""),
              GamaaCodes("""جامعة بنها
          مقر الجامعة: محافظة القليوبية- بنها شارع فريد ندا
          الموقع الإلكترونى: https://bu.edu.eg /
          طريقة التقديم: التنسيق الإلكترونى
          طرق التواصل مع الجامعة:
          تليفون: 0133231011- 0133231012
          فاكس: 0133227491- 0133213511
          تضم جامعة بنها 16 كلية وهى:
          كلية الهندسة بشبرا- كلية الهندسة ببنها- كلية الحاسبات والذكاء الاصطناعى- كلية العلوم- كلية الزراعة- كلية الفنون التطبيقية- كلية التجارة- كلية التربية- كلية التربية النوعية- كلية التربية الرياضية- كلية الحقوق- كلية الآداب- كلية الطب البشرى- كلية الطب البيطرى- كلية التمريض- كلية العلاج الطبيعى.
          
          """),
              GamaaCodes("""جامعة كفر الشيخ
          
          مقر الجامعة: جامعة كفر الشيخ مصر- كفر الشيخ
          تليفون الجامعة: 002-047-3109590
          الموقع الإلكترونى: https://kfs.edu.eg/
          طريقة التقديم: التنسيق الإلكترونى
          يوجد بها 19 كلية ومعهدًا وهى:
          كلية الزراعة- كلية الهندسة- كلية العلوم- كلية الثروة السمكية- كلية الحاسبات والمعلومات- معهد علوم تكنولوجيا النانو- كلية الذكاء الاصطناعى- كلية الطب البيطرى- كلية الصيدلة- كلية الطب البشرى- كلية التمريض- كلية العلاج الطبيعى- كلية طب وجراحة الفم والأسنان- المعهد الفنى للتمريض- كلية التربية- كلية الآداب- كلية التجارة- كلية التربية النوعية- كلية التربية الرياضية- كلية الألسن- كلية الحقوق."""),
              GamaaCodes("""جامعة طنطا
          
          مقر الجامعة: طنطا- شارع الجيش
          طرق التواصل مع الجامعة:
          تليفون 3317928 040 2+
          الإيميل: tanta_unv@unv.tanta.edu.eg
          الموقع الإلكترونى: https://tanta.edu.eg/
          طرق التقديم: التنسيق الإلكترونى
          تضم جامعة طنطا 15 كلية ومعهدًا وهى: كلية الطب- كلية الصيدلة- كلية طب الأسنان- كلية التمريض- المعهد الفنى للتمريض- كلية العلوم- كلية الهندسة- كلية الزراعة- كلية الحاسبات والمعلومات- كلية التربية- كلية التربية النوعية- كلية التجارة- كلية الآداب- كلية الحقوق.
          
          """),
              GamaaCodes("""جامعة سوهاج
          مقر الجامعة: محافظة سوهاج- مدينة ناصر- شارع جامعة سوهاج
          طرق التقديم: التنسيق الإلكترونى
          طرق التواصل مع الجامعة:
          رقم الهاتف: 0934570000
          الفاكس: 0934605745
          البريد الإلكترونى: president@sohag.edu.eg
          تضم جامعة سوهاج 17 كلية وهى:
          كلية العلوم- كلية التربية- كلية الآداب- كلية التجارة- كلية الحاسبات والذكاء الاصطناعى- كلية الطب- كلية الزراعة- كلية التكنولوجيا والتعليم الصناعى- كلية التمريض- كلية الهندسة.
          
          """),
              GamaaCodes("""جامعة بورسعيد
          
          مقر الجامعة: محافظة بورسعيد- بورفؤاد
          تليفون الجامعة: 066 3402344
          البريد الإلكترونى: https://psu.edu.eg/
          طريقة التقديم: التنسيق الإلكترونى
          يوجد بها 13 كلية وهى:
          كلية الهندسة- كلية العلوم- كلية الطب- كلية الصيدلة- كلية التمريض- كلية التربية- كلية التربية النوعية- كلية التربية للطفولة المبكرة- كلية التربية الرياضية- كلية التجارة- كلية الآداب- كلية الحقوق- كلية تكنولوجيا الإدارة ونظم المعلومات.
          
          """),
              GamaaCodes("""جامعة جنوب الوادى
          
          المقر: تقع في محافظة قنا
          الموقع الإلكترونى:
          https://www.svu.edu.eg/ar/
          طريقة التقديم: التنسيق الإلكترونى
          طرق التواصل:
          فاكس:20963211279+
          تليفون: 20963211281+
          البريد الإلكترونى: info@svu.edu.eg
          تضم جامعة جنوب الوادى 23 كلية ومعهدًا وهى:
          كلية التربية- كلية الطب البيطرى- كلية الزراعة- كلية التربية الرياضية- كلية الهندسة.
          
          """),
              GamaaCodes("""جامعة بنى سويف
          مقر الجامعة: محافظة بنى سويف- شارع صلاح سالم
          تليفون الجامعة: (082) 2356845
          طريقة التقديم: التنسيق الإلكترونى
          يوجد بها 28 كلية وأربعة معاهد وهى:
          كلية التجارة- كلية الآداب- كلية التربية- كلية الحقوق- كلية الطب- كلية الطب البيطرى- كلية العلوم- كلية الصيدلة- كلية التمريض- كلية التربية الرياضية- كلية الهندسة- كلية التكنولوجيا والتعليم- كلية الحاسبات والذكاء الاصطناعى- كلية السياسة والاقتصاد- كلية الدراسات العليا للعلوم المتقدمة- كلية طب الأسنان- كلية الإعلام- كلية العلاج الطبيعى- كلية الزراعة- كلية تكنولوجيا العلوم الصحية التطبيقية- كلية التربية للطفولة المبكرة- كلية الفنون التطبيقية- كلية الألسن- كلية الخدمة الاجتماعية التنموية- كلية علوم الأرض- كلية السياحة والفنادق- كلية علوم ذوى الاحتياجات الخاصة"""),
              GamaaCodes("""جامعة الفيوم
          
          مقر الجامعة: 32 شارع زيد بن حارثة- قسم الفيوم- الفيوم
          تليفون الجامعة: 2114059 084
          الموقع الإلكترونى: https://www.fayoum.edu.eg/
          طريقة التقديم: التنسيق الإلكترونى
          يوجد بها 19 كلية ومعهدان وهى:
          كلية التربية- كلية الزراعة- كلية الهندسة- كلية الخدمة الاجتماعية- كلية دار العلوم- كلية العلوم- كلية السياحة والفنادق- كلية التربية النوعية- كلية الآثار- كلية الطب- كلية الآداب- كلية الحاسبات والمعلومات- كلية التربية للطفولة المبكرة- كلية التمريض- معهد دول حوض النيل- كلية طب الأسنان- كلية الصيدلة- كلية الحقوق- كلية التربية الرياضية- كلية الألسن- المعهد الفنى للتمريض."""),
              GamaaCodes("""جامعة المنيا
          مقر الجامعة: الطريق العمومى- أرض شلبى- المنيا
          رقم التليفون: 2334646 أو 2372261 (086)
          الموقع الإلكترونى: https://www.minia.edu.eg/Minia/
          طريقة التقديم: التنسيق الإلكترونى
          يوجد بها 20 كلية وهى:
          كلية الحاسبات والمعلومات- كلية الطب- كلية الهندسة- كلية الصيدلة- كلية الفنون الجميلة- كلية طب الأسنان- كلية الألسن- كلية الطب البيطرى- كلية التربية- كلية التمريض- كلية التربية الفنية- كلية العلوم- كلية تربية طفولة- كلية الزراعة- كلية التربية النوعية- كلية السياحة والفنادق- كلية دار العلوم- كلية الآداب- كلية الحقوق- كلية التربية الرياضية.
          
          """),
              GamaaCodes("""جامعة السويس
          مقر الجامعة: مدينة السلام- طريق السويس- السويس
          رقم التليفون: 3669913 أو 3707068 (062)
          الموقع الإلكترونى: http://suezuniv.edu.eg/index.php/ar/http://suezuniv.edu.eg/index.php/ar/
          طريقة التقديم: التنسيق الإلكترونى
          يوجد بها 13 كلية وهى:
          كلية هندسة البترول والتعدين- كلية التكنولوجيا والتعليم- كلية العلوم- كلية الثروة السمكية- كلية الحاسبات والمعلومات- كلية الهندسة- كلية الطب البشرى- كلية طب الأسنان- المعهد الفنى للتمريض- كلية التجارة- كلية الآداب- كلية السياسة والاقتصاد- كلية الإعلام وتكنولوجيا الاتصال.
          
          """),
              GamaaCodes("""جامعة العريش
          مقر الجامعة: ضاحية السلام- العريش- شمال سيناء
          تليفون الجامعة: 068-3320523
          الموقع الإلكترونى: https://aru.edu.eg/ar
          طريقة التقديم: التنسيق الإلكترونى
          يوجد بها 11 كلية وهى:
          كلية الطب البيطرى- كلية العلوم الزراعية البيئية- كلية العلوم الزراعية البيئية- كلية الاستزراع المائى والمصائد البحرية- كلية التجارة- كلية الآداب- كلية الحاسبات والمعلومات- كلية التربية- كلية التربية الرياضية- كلية العلوم- كلية الاقتصاد المنزلى- معهد الدراسات البيئية.""")
            ],
          ),
        ),
      ),
    );
  }
}
