import 'package:flutter/material.dart';

import '../HotLineModel.dart';

class HotLine extends StatelessWidget {

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: Text("الخط الساخن",style: TextStyle(color: Colors.white),),
      centerTitle: true,
      backgroundColor: Colors.blueGrey,
      ),
      backgroundColor: Colors.grey,
      body: SingleChildScrollView(
        child: Container(
          decoration: BoxDecoration(
            image: DecorationImage(
              image: AssetImage("asset/pattern.png"),
              fit: BoxFit.cover,
            ),
          ),
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.stretch,
            children: [
              HotLineModel('''النجدة	122
          
الإسعاف	123

المطافئ	180

إنفلونزا الطيور	105

حوداث المرور	121110000

الرعاية الحرجة والعاجلة	16474

شكاوى المياه	125

شكاوى الكهرباء	121

شكاوى الغاز	129

الهيئة العامة لنظافة وتجميل القاهرة	152

الهيئة العامة للصرف الصحى	175

مرفق الاتصالات	155

المجلس القومى للأمومة والطفولة	16000

المجلس القومى لحقوق الانسان	16021

كول سنتر المصرية والاتصالات	19932

مركز معلومات شبكات المرافق	111

مشروع حساب لكل بيت	19895

مرفق الاتصالات	19246'''),
              HotLineModel('''الأمن العام	115
              
          وزارة الداخلية	138
          
          دار الإفتاء المصرية	107
          
          الهيئة العامة للتأمين الصحى	106
          
          التربية والتعليم	19151
          
          الهيئة العامة لتعليم الكبار	19556
          
          وزارة السياحة	19654
          
          وزارة الدفاع	19136
          
          وزارة البيئة	19808
          
          الهيئة العامة للتأمين الصحى	19806
          
          وزارة التربية والتعليم	19126
          
          جامعة القاهرة_ مركز التعليم المفتوح	19545
          
          الهئيةالعامة للخدمات البيطرية	19561
          
          وزارة التجارة والصناعة	19805
          
          هيئة الرقابة الإدارية	16100
          
          هيئة سوق المال	16916
          
          البريد المصري	16789
          
          الهيئة القومية للتأمينات الإجتماعية	16217
          
          الهيئة العامة للاستثمار	16035
          
          هئية تنمية صناعة تكنولوجيا المعلومات	16248
          
          الصندوق الإجتماعى للتنمية	19733
          
          الهيئة العامة للرقابة على الصادرات	19591
          
          مبيعات كبار العملاء	19526
          
          الهئية المصرية للرقابة على التأمين	19053
          
          مجلس التدريب الصناعى	16456
          
          تكنولوجيا تشغيل المنشآت المالية	19680''')
            ],
          ),
        ),
      ),
    );
  }
}
